In [2]:
import pandas as pd

## Series

In [6]:
#Criando uma série de um 1 a 10
data = [i for i in range(1, 11)]
s = pd.Series(data)
s

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [7]:
#criando index para Series criada a acima
index = ['Linha' + str(i) for i in range(10)]
index

['Linha0',
 'Linha1',
 'Linha2',
 'Linha3',
 'Linha4',
 'Linha5',
 'Linha6',
 'Linha7',
 'Linha8',
 'Linha9']

In [8]:
#juntando dados com index
s = pd.Series(data=data, index=index)
s

Linha0     1
Linha1     2
Linha2     3
Linha3     4
Linha4     5
Linha5     6
Linha6     7
Linha7     8
Linha8     9
Linha9    10
dtype: int64

In [9]:
#Criando a series a partir de um dicionário, logo ele ja terá o indice, por conta da estrutura do dicionário
data ={'Linha' + str(i) : i + 1 for i in range(10)}
s = pd.Series(data)
s

Linha0     1
Linha1     2
Linha2     3
Linha3     4
Linha4     5
Linha5     6
Linha6     7
Linha7     8
Linha8     9
Linha9    10
dtype: int64

In [11]:
#Aletrando valores dentro da Series
s1 = s + 8
s1

Linha0     9
Linha1    10
Linha2    11
Linha3    12
Linha4    13
Linha5    14
Linha6    15
Linha7    16
Linha8    17
Linha9    18
dtype: int64

In [12]:
#lembrando que isso só foi permitido, pois as Series possuem o mesmo tamanho.
s2 = s + s1
s2

Linha0    10
Linha1    12
Linha2    14
Linha3    16
Linha4    18
Linha5    20
Linha6    22
Linha7    24
Linha8    26
Linha9    28
dtype: int64

## DataFrame

In [64]:
data = [[i for i in range(1, 4)], [j for j in range(4,7)], [k for k in range(7,10)]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [65]:
df1 = pd.DataFrame(data = data)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [66]:
index = ['Linha' + str(i) for i in range(3)]
index

['Linha0', 'Linha1', 'Linha2']

In [67]:
df1 = pd.DataFrame(data=data, index=index)
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [68]:
columns = ['coluna' + str(i) for i in range(3)]
columns

['coluna0', 'coluna1', 'coluna2']

In [69]:
df1 = pd.DataFrame(data=data, index=index, columns=columns)
df1

        coluna0  coluna1  coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [70]:
data = {'coluna0': {'Linha' + str(i) : i for i in range(0,3)},
       'coluna1': {'Linha' + str(j) : j for j in range(0,3)},
       'coluna2': {'Linha' + str(k) : k for k in range(0,3)}}
data

{'coluna0': {'Linha0': 0, 'Linha1': 1, 'Linha2': 2},
 'coluna1': {'Linha0': 0, 'Linha1': 1, 'Linha2': 2},
 'coluna2': {'Linha0': 0, 'Linha1': 1, 'Linha2': 2}}

In [71]:
df2 = pd.DataFrame(data)
df2

        coluna0  coluna1  coluna2
Linha0        0        0        0
Linha1        1        1        1
Linha2        2        2        2

In [72]:
df3 = pd.concat([df1,df2])
df3

        coluna0  coluna1  coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9
Linha0        0        0        0
Linha1        1        1        1
Linha2        2        2        2

In [73]:
df3 = pd.concat([df1,df2], axis=1)
df3

        coluna0  coluna1  coluna2  coluna0  coluna1  coluna2
Linha0        1        2        3        0        0        0
Linha1        4        5        6        1        1        1
Linha2        7        8        9        2        2        2

## Auxilio para resolver as questões propostas durante o curso

In [74]:
df1 = pd.DataFrame({'A': {'X': 1}, 'B': {'X': 2}})
df2 = pd.DataFrame({'C': {'X': 3}, 'D': {'X': 4}})
pd.concat([df1, df2])

     A    B    C    D
X  1.0  2.0  NaN  NaN
X  NaN  NaN  3.0  4.0

In [75]:
dados = [('A', 'B'), ('C', 'D')]
df = pd.DataFrame(dados, columns = ['L1', 'L2'],  index = ['C1', 'C2'])
df

   L1 L2
C1  A  B
C2  C  D

In [76]:
dados = [[1, 2, 3], [4, 5, 6]]
index = 'X,Y'.split(',')
columns = list('CBA')[::-1]
df = pd.DataFrame(dados, index, columns)
df

   A  B  C
X  1  2  3
Y  4  5  6

In [77]:
dados = {'A': {'X': 1, 'Y': 3}, 'B': {'X': 2, 'Y': 4}}
df = pd.DataFrame(dados)
df

   A  B
X  1  2
Y  3  4